Experimental/BubbleColumn/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          25;
        startFace       7325;
    }
    outlet
    {
        type            patch;
        nFaces          25;
        startFace       7350;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       7375;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          7500;
        startFace       7675;
    }
)

// ************************************************************************* //
