Experimental/BubbleColumn/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    inlet
    {
        type               fixedValue;
        value              uniform 0.01;
    }
    outlet
    {
        type               inletOutlet;
        inletValue         $internalField;
        value              $internalField;
    }
    walls
    {
        type               omegaWallFunction;
        value              $internalField;
    }
}

// ************************************************************************* //
