Experimental/BubbleColumn/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        nAlphaCorr      2;
        nAlphaSubCycles 5;
        nLimiterIter    3;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-8;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-9;
        relTol          0;
    }

    "pcorr.*"
    {
        $p_rgh;
        tolerance       1e-5;
        relTol          0;
    }

//    "U.*"
//    {
//        solver          GAMG;
//        smoother        DIC;
//        tolerance       1e-8;
//        relTol          0.01;
//        solver          smoothSolver;
//        smoother        symGaussSeidel;
//        tolerance       1e-08;
//        relTol          0;
//    }

    "T.*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }

    "Theta.*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }

    "k.*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }

    "omega.*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }

    "(S|X).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-08;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors         50;
    nCorrectors              4;
    nNonOrthogonalCorrectors 0;
    pRefCell                 1;
    pRefValue                0;
    residualControl
    {
        "(p.*|U.*)"
        {
            tolerance 1e-5;
            relTol 0;
        }
    }
}

relaxationFactors
{
    equations
    {
        "U.*"           0.9;
        "T.*"           1;
        "alpha.*"       1;
        "Theta.*"       1;
        "k.*"           1;
        "epsilon.*"     1;
        "(S|X).*"       1;
    }
}


// ************************************************************************* //
